tutorials/RAS/Grilli2017/2D_landslideWave/0_org/k.fluid
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      ps;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 1e-6;
boundaryField
{
    inlet
    {
        type            zeroGradient;
    }
    outlet
    {
        type            zeroGradient;
    }
    top
    {
        type            zeroGradient;
    }
    bottom
    {
        type            kqRWallFunction;
        value           uniform 1e-6;    }
    plane
    {
        type            kqRWallFunction;
        value           uniform 1e-6;    }
    planeA
    {
        type            kqRWallFunction;
        value           uniform 1e-6;    }
    backPlane
    {
        type            empty;
    }
    frontPlane
    {
        type            empty;
    }
}


// ************************************************************************* //
