tutorials/RAS/Grilli2017/2D_landslideWave/constant/granularRheologyProperties
/*
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      granaularRheologyProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

granularRheology   on;

granularDilatancy  off;

alphaMaxG       alphaMaxG [ 0 0 0 0 0 0 0 ] 0.625;

mus             mus  [ 0 0 0 0 0 0 0 ] 0.41;

mu2             mu2  [ 0 0 0 0 0 0 0 ] 0.76;

I0              I0  [ 0 0 0 0 0 0 0 ] 0.1;

Bphi            Bphi [ 0 0 0 0 0 0 0 ] 1.;

n               n [ 0 0 0 0 0 0 0 ] 2.5;

Dsmall          Dsmall [ 0 0 -1 0 0 0 0 ] 1e-6;

BulkFactor      BulkFactor [ 0 0 0 0 0 0 0 ] 0e0;

K_dila      K_dila [ 0 0 0 0 0 0 0 ] 0;

relaxPs         relaxPs [ 0 0 0 0 0 0 0 ] 1e-4;

// FrictionModel   Coulomb;
FrictionModel   MuIv;

//PPressureModel  none;
PPressureModel  MuIv;

FluidViscosityModel BoyerEtAl;

// ************************************************************************* //
