tutorials/RAS/Grilli2017/2D_landslideWave/constant/turbulenceProperties.fluid
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      turbulenceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType  RAS;

RAS{
RASModel        twophasekOmega;

    turbulence      on;
    printCoeffs     on;
    twophasekOmegaCoeffs
    {


        alphaOmega       0.52;
        betaOmega        0.0708; // original k-omega: 0.072 // k-omega (2006): 0.0708
        C3om             0.35;
        C4om             1.0;
        alphaKomega      0.5; // original k-omega: 0.5 // k-omega (2006): 0.6
        alphaOmegaOmega  0.5;
        Clim             0.875; // original k-omega: 0.0 // k-omega (2006): 0.875
        sigmad           0.125; // original k-omega: 0.0 // k-omega (2006): 0.125
        Cmu              0.09;
        KE2              1.0; //turb modulation
        KE4              1.0; //density stratification g  
        nutMax           5e-3;
        popeCorrection   false;
    }


}


// ************************************************************************* //
