tutorials/RAS/Grilli2017/2D_landslideWave/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;




vertices
(
    (0 0     0.25) //0
    (6 0     0.25) //1
    (6 0.50  0.25) //2
    (0 0.50 0.25) //3
    (0 0    -0.0) //4
    (6 0    -0.0) //5
    (6 0.50 -0.0) //6
    (0 0.50 -0.0) //7
);
blocks
(
    hex (0 1 5 4 3 2 6 7) (600 1 50) simpleGrading (1 1 1)

);

edges
(
);






patches
(
    patch inlet
    (
	(0 3 7 4)
    )
    patch outlet
    (
	(1 5 6 2)
    )
    wall top
    ((7 6 2 3)
    )
    wall bottom
    (
    (0 4 5 1)
    )
    // patch plane
    // (
    // )
    empty backPlane
    (
	(0 1 2 3)
    )
    empty frontPlane
    (
    (4 7 6 5)
  //  (4 5 6 7)
    )
);


mergePatchPairs
(
);

// ************************************************************************* //
