tutorials/RAS/Grilli2017/2D_landslideWave/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     sedFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         8;

deltaT          1e-9;

writeControl    adjustableRunTime;

writeInterval   2e-2;

purgeWrite      0;

writeFormat     binary;

writePrecision  9;

timeFormat      general;

timePrecision   9;

runTimeModifiable on;

adjustTimeStep  on;

maxCo           0.01;

maxAlphaCo      0.01;

maxDeltaT       1e-4;

functions
{
    #sinclude   "sampling"
}
// ************************************************************************* //
