tutorials/RAS/Grilli2017/2D_landslideWave/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
}
divSchemes
{
    default         none;

    // alpha / gamma
    div(phi,alphas)  Gauss limitedLinear01 1;
    div(phir,alphas) Gauss limitedLinear01 1;

    div(phi,gamma)   Gauss limitedLinear01 1;
    div(phir,gamma)  Gauss limitedLinear01 1;

    div(U.fluid) Gauss linear;

    // UEqn
    div(phi.solid,U.solid) Gauss limitedLinearV 1;
    div(phi.fluid,U.fluid) Gauss limitedLinearV 1;
    div(rhoPhi,U.fluid)    Gauss limitedLinearV 1;

    div((interpolate(rhof)*phif),Uf) Gauss limitedLinearV 1;
    div((rho*phi.solid),U.solid)     Gauss limitedLinearV 1;
    div((rho*phif),Uf)               Gauss limitedLinearV 1;

    div((rho*Rcs))  Gauss linear;
    div((rhof*Rcf)) Gauss linear;

    div(phiRs,Us) Gauss limitedLinear 1;
    div(phiRf,Uf) Gauss limitedLinear 1;

    // turbulence
    div(phi.fluid,k.fluid)     Gauss limitedLinear 1;
    div(phi.fluid,omega.fluid) Gauss limitedLinear 1;
    div(phif,omega)            Gauss limitedLinear 1;

    // pEqn
    div(alphas,nu) Gauss linear;

    // alphaPlastic
    div(phis,alphasPlastic) Gauss limitedLinear01 1;

    // pa
    div(phis,ps_new_value) Gauss limitedLinear 1;
}

laplacianSchemes
{
    default         Gauss linear corrected;
// UEqn
    laplacian(nuEffs,U.solid) Gauss linear corrected;
    laplacian(nuEfff,Uf) Gauss linear corrected;
    laplacian(nuFrs,U.solid)  Gauss linear corrected;
// pEqn
    laplacian((rho*(1|A(U))),p_rbgh) Gauss linear corrected;
}

interpolationSchemes
{
    default  linear;
}

snGradSchemes
{
    default         corrected;
}

fluxRequired
{
    default         no;
    alpha.solid;
    alpha.water;
    p_rgh;
    gamma;
}


// ************************************************************************* //
